; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	image0 - mode
	thermograph2 - mode
	thermograph1 - mode
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Star3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 124)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 114)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star3)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star3)
	(supports instrument5 thermograph1)
	(supports instrument5 image0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet4)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 158)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph2)
	(supports instrument6 image0)
	(calibration_target instrument6 Star3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet4)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 111)
	(= (data Planet4 image0) 156)
	(= (data Phenomenon5 image0) 203)
	(= (data Phenomenon6 image0) 57)
	(= (data Star7 image0) 45)
	(= (data Planet4 thermograph2) 227)
	(= (data Phenomenon5 thermograph2) 36)
	(= (data Phenomenon6 thermograph2) 178)
	(= (data Star7 thermograph2) 114)
	(= (data Planet4 thermograph1) 218)
	(= (data Phenomenon5 thermograph1) 125)
	(= (data Phenomenon6 thermograph1) 194)
	(= (data Star7 thermograph1) 238)
	(= (slew_time Star2 Star0) 8.338)
	(= (slew_time Star0 Star2) 8.338)
	(= (slew_time Star2 GroundStation1) 10.33)
	(= (slew_time GroundStation1 Star2) 10.33)
	(= (slew_time GroundStation1 Star0) 70.6)
	(= (slew_time Star0 GroundStation1) 70.6)
	(= (slew_time Star3 Star0) 29.85)
	(= (slew_time Star0 Star3) 29.85)
	(= (slew_time Star3 GroundStation1) 25.85)
	(= (slew_time GroundStation1 Star3) 25.85)
	(= (slew_time Star3 Star2) 33.93)
	(= (slew_time Star2 Star3) 33.93)
	(= (slew_time Planet4 Star0) 21.68)
	(= (slew_time Star0 Planet4) 21.68)
	(= (slew_time Planet4 GroundStation1) 31.6)
	(= (slew_time GroundStation1 Planet4) 31.6)
	(= (slew_time Planet4 Star2) 63.49)
	(= (slew_time Star2 Planet4) 63.49)
	(= (slew_time Planet4 Star3) 34.18)
	(= (slew_time Star3 Planet4) 34.18)
	(= (slew_time Phenomenon5 Star0) 11.51)
	(= (slew_time Star0 Phenomenon5) 11.51)
	(= (slew_time Phenomenon5 GroundStation1) 42.81)
	(= (slew_time GroundStation1 Phenomenon5) 42.81)
	(= (slew_time Phenomenon5 Star2) 40.82)
	(= (slew_time Star2 Phenomenon5) 40.82)
	(= (slew_time Phenomenon5 Star3) 1.752)
	(= (slew_time Star3 Phenomenon5) 1.752)
	(= (slew_time Phenomenon5 Planet4) 57.23)
	(= (slew_time Planet4 Phenomenon5) 57.23)
	(= (slew_time Phenomenon6 Star0) 9.506)
	(= (slew_time Star0 Phenomenon6) 9.506)
	(= (slew_time Phenomenon6 GroundStation1) 56.55)
	(= (slew_time GroundStation1 Phenomenon6) 56.55)
	(= (slew_time Phenomenon6 Star2) 37.82)
	(= (slew_time Star2 Phenomenon6) 37.82)
	(= (slew_time Phenomenon6 Star3) 15.67)
	(= (slew_time Star3 Phenomenon6) 15.67)
	(= (slew_time Phenomenon6 Planet4) 54.41)
	(= (slew_time Planet4 Phenomenon6) 54.41)
	(= (slew_time Phenomenon6 Phenomenon5) 21.76)
	(= (slew_time Phenomenon5 Phenomenon6) 21.76)
	(= (slew_time Star7 Star0) 61.34)
	(= (slew_time Star0 Star7) 61.34)
	(= (slew_time Star7 GroundStation1) 35.11)
	(= (slew_time GroundStation1 Star7) 35.11)
	(= (slew_time Star7 Star2) 38.38)
	(= (slew_time Star2 Star7) 38.38)
	(= (slew_time Star7 Star3) 49.95)
	(= (slew_time Star3 Star7) 49.95)
	(= (slew_time Star7 Planet4) 39.95)
	(= (slew_time Planet4 Star7) 39.95)
	(= (slew_time Star7 Phenomenon5) 27.56)
	(= (slew_time Phenomenon5 Star7) 27.56)
	(= (slew_time Star7 Phenomenon6) 33.74)
	(= (slew_time Phenomenon6 Star7) 33.74)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Phenomenon5)
	(pointing satellite2 Star2)
	(pointing satellite3 Phenomenon6)
	(have_image Planet4 thermograph2)
	(have_image Phenomenon5 thermograph1)
	(have_image Phenomenon6 image0)
	(have_image Star7 thermograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite3 star0 planet4)
   deleted: (pointing satellite3 planet4)
   added: (pointing satellite3 star0)
   changed: (fuel satellite3) from 111 to 89.32, (fuel-used) from 0 to 21.68
   goals met: 0 of 7
2. (turn_to satellite2 star0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 158 to 136.32, (fuel-used) from 21.68 to 43.36
   goals met: 0 of 7
3. (turn_to satellite2 phenomenon5 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 136.32 to 124.81, (fuel-used) from 43.36 to 54.87
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon5 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 114 to 102.49, (fuel-used) from 54.87 to 66.38
   goals met: 1 of 7
5. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 7
6. (turn_to satellite3 star3 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star3)
   changed: (fuel satellite3) from 89.32 to 59.47, (fuel-used) from 66.38 to 96.23
   goals met: 1 of 7
7. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 7
8. (calibrate satellite3 instrument6 star3)
   added: (calibrated instrument6)
   goals met: 1 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
10. (turn_to satellite0 star2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 124 to 60.51, (fuel-used) from 96.23 to 159.72
   goals met: 1 of 7
11. (turn_to satellite3 phenomenon6 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 phenomenon6)
   changed: (fuel satellite3) from 59.47 to 43.8, (fuel-used) from 159.72 to 175.39
   goals met: 2 of 7
12. (turn_to satellite2 star0 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 124.81 to 113.3, (fuel-used) from 175.39 to 186.9
   goals met: 2 of 7
13. (turn_to satellite1 star0 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 102.49 to 90.98, (fuel-used) from 186.9 to 198.41
   goals met: 1 of 7
14. (take_image satellite3 phenomenon6 instrument6 image0)
   added: (have_image phenomenon6 image0)
   changed: (data_capacity satellite3) from 1000 to 943, (data-stored) from 0 to 57
   goals met: 2 of 7
15. (turn_to satellite2 star3 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 113.3 to 83.45, (fuel-used) from 198.41 to 228.26
   goals met: 2 of 7
16. (turn_to satellite2 phenomenon5 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 83.45 to 81.698, (fuel-used) from 228.26 to 230.012
   goals met: 2 of 7
17. (switch_off instrument5 satellite2)
   deleted: (power_on instrument5)
   added: (power_avail satellite2)
   goals met: 2 of 7
18. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 90.98 to 69.3, (fuel-used) from 230.012 to 251.692
   goals met: 2 of 7
19. (turn_to satellite1 phenomenon5 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 69.3 to 12.07, (fuel-used) from 251.692 to 308.922
   goals met: 3 of 7
20. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 3 of 7
21. (turn_to satellite0 star0 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 60.51 to 52.172, (fuel-used) from 308.922 to 317.26
   goals met: 3 of 7
22. (turn_to satellite0 planet4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 52.172 to 30.492, (fuel-used) from 317.26 to 338.94
   goals met: 3 of 7
23. (turn_to satellite2 star3 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 81.698 to 79.946, (fuel-used) from 338.94 to 340.692
   goals met: 3 of 7
24. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 3 of 7
25. (turn_to satellite2 phenomenon5 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 79.946 to 78.194, (fuel-used) from 340.692 to 342.444
   goals met: 3 of 7
26. (turn_to satellite2 star3 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 78.194 to 76.442, (fuel-used) from 342.444 to 344.196
   goals met: 3 of 7
27. (calibrate satellite2 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 3 of 7
28. (turn_to satellite2 phenomenon5 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 76.442 to 74.69, (fuel-used) from 344.196 to 345.948
   goals met: 3 of 7
29. (take_image satellite2 phenomenon5 instrument4 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   changed: (data_capacity satellite2) from 1000 to 875, (data-stored) from 57 to 182
   goals met: 4 of 7
30. (turn_to satellite2 star7 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 74.69 to 47.13, (fuel-used) from 345.948 to 373.508
   goals met: 4 of 7
31. (take_image satellite2 star7 instrument4 thermograph2)
   added: (have_image star7 thermograph2)
   changed: (data_capacity satellite2) from 875 to 761, (data-stored) from 182 to 296
   goals met: 5 of 7
32. (turn_to satellite2 star2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 47.13 to 8.75, (fuel-used) from 373.508 to 411.888
   goals met: 6 of 7
33. (take_image satellite0 planet4 instrument0 thermograph2)
   added: (have_image planet4 thermograph2)
   changed: (data_capacity satellite0) from 1000 to 773, (data-stored) from 296 to 523
   goals met: 7 of 7
